<!DOCTYPE html>
<html>
  <head>
    <title>Sri Damodarastakam</title>
	<link rel="stylesheet" href="styles_damodar.css" />
  </head>
  <body>
    <header>
	  <h1>Importance of the &#256;malak&#299; Tree in the Month of K&#257;rttika</h1>
	</header>
	<div id="story">
	  <p>
	    It has been stated in the scriptures that during the month of K&#257;rttika, on the Caturda&#347;&#299; during the <em>&#347;ukla-pak&#7779;a</em>, one should worship the <em>&#257;malak&#299;</em> tree, as this great tree removes all sins.  This Caturda&#347;&#299; is known as Vaiku&#7751;&#7789;ha-caturda&#347;&#299;, and it is recommended that on this day one should worship &#346;r&#299; Hari along with &#346;r&#299; R&#257;dh&#257; under the shadow of an <em>&#257;malak&#299;</em> tree.  One should then circumambulate the three one hundred and eight times and offer obeisances and prayers to Lord &#346;y&257;masundara, &#346;r&#299; K&#7771;&#7779;&#7751;a.  After offering prayers, one should sit down under the <em>&#257;malak&#299;</em> tree and listen to the glories of <em>&#257;malak&#299;</em>.  Finally, one should feed some <em>br&#257;hma&#7751;as</em> and offer them <em>dak&#7779;i&#7751;&#257;</em>, as pleasing the <em>br&#257;hma&#299;as</em> gives pleasure to Lord &#346;r&#299; Hari, who is the giver of liberation.<br /><span style='text-decoration: underline'>Appearance of the <em>&#257;malak&#299;</em> tree</span>:
	  </p>
	  <p>
	    At the beginning of creation, the entire universe was submerged under water.  At that time Lord Brahm&#257; began chanting the holy name of the Lord.  Out of ecstasy due to eagerness to see the Lord, tears fell from Brahm&#257;'s eyes.  That water which consisted of his tears of love fell on the earth planet.  From these tears, the <em>&#257;malak&#299;</em> tree appeared and developed into a huge tree, expanding its branches and sub-branches, and was laden with <em>&#257;malak&#299;</em> fruits.  The <em>&#257;malak&#299;</em> tree appeared first, before any other tree, and is therefore known as <em>&#34;&#257;diruha&#34;</em>.  <em>&#34;&#256;di&#34;</em> means original and <em>&#34;ruha&#34;</em> means tree.  After the creation of the <em>&#257;malak&#299;</em> tree, all other living entities were created.  When the <em>devas</em> were created they all came to the place where Lord Vi&#7779;&#7751;u's favourite tree, the <em>&#257;malak&#299;</em>, was born.  They were surprised to see the <em>&#257;malak&#299;</em> tree.  Just then, a voice fromt he sky proclaimed to the demigods.  &#34;This <em>&#257;malak&#299;</em> tree is the best among all trees, because it is very dear to Lord Vi&#7779;&#7751;u.  Just by remembering this tree one will achieve the result of giving a cow in charity.  By taking <em>dar&#347;ana</em> of this tree one will double this result.  By eating the fruit of this tree one will triple this result.  One should always serve the <em>&#257;malak&#299;</em> tree very carefully, because this tree is very dear to Lord Vi&#7779;&#7751;u and has the power to destroy all sins.  One should worship the <em>&#257;malak&#299;</em> tree for the fulfilment of all one's desires.  Whoever worships Lord &#346;r&#299; Hari in forests of <em>&#257;malak&#299;</em> during the month of K&#257;rttika, and takes <em>pras&#257;da</em> under the shadow of this tree, will be free from all kinds of sins.  Any pious activities performed under the shadow of the <em>&#257;malak&#299;</em> tree will give millions of times the benefit.
	  </p>
	  <p>
	    Long, long ago there was a great <em>br&#257;hma&#7751;a</em> named Deva&#347;arm&#257;, who was living on the northern bank of the K&#257;ver&#299; River.  He was very expert in all the <em>Vedas</em> and <em>Ved&#257;&#7749;gas</em>.  Unfortunately he had a son who was a great <em>dur&#257;c&#257;r&#299;</em>, a notorious person devoid of any good behaviour.  One day Deva&#347;arm&#257;, for the benefit of his son, advised him, &#34;O, my dear son&#33; Now it is the month of K&#257;rttika which is very dear to Lord Vi&#7779;&#7751;u.  You should follow all the rules, take an early bath daily, give charity, and follow a <em>vrata</em> during this month.  You should worship Lord Vi&#7779;&#7751;u with <em>tulas&#299; ma&ntilde;jar&#299;s</em>.  Offer a lamp to the Lord, offer obeisances and circumambulate Lord &#346;r&#299; Hari.&#34;  When that wicked boy heard this advice from his father he became very angry.  His lips began to tremble in anger and he rebuked and blasphemed his father, saying, &#34;Father&#33; I do not need the <em>pu&#7751;ya</em> of performing a K&#257;rttika-vrata.  I will not observe this K&#257;rttika-vrata.&#34;  After hearing this kind of loose talk from his son, Deva&#347;arm&#257; with great anger said, &#34;O less intelligent&#33; I curse you to become a rat and reside in the trunk of a tree.&#34;
	  </p>
	  <p>
	    Upon hearing this curse from his father, the boy became very afraid.  He offered his obeisance to his father and asked, &#34;Please tell me how I can become free from that species of life?  How long will I remain in the form of a rat?&#34;  After hearing this gentle speech of his son, Deva&#347;arm&#257; was pleased and said, &#34;When you hear the glories of K&#257;rttika-vrata, which is very dear to Lord Vi&#7779;&#7751;u, you will be liberated.&#34;  After hearing this from his father he immediately transformed into the form of a rat and stayed in a dense forest for many years.  One day, in the month of K&#257;rttika, Vi&#347;v&#257;mitra &#7770;&#7779;i along with his folloers came to the same forest.  They took bath in teh river and worshipped Lord Hari, after which they took shelter of the shade of an <em>&#257;makal&#299;</em> tree.  There Vi&#347;v&#257;mitra &#7770;&#7779;i began to describe the glories of the month of K&#257;rttika as his disciples sat nearby to listen.
	  </p>
	  <p>
	    There happened to be a hunter roaming the forest at that time.  He was particularly vicious, with a desire to kill not only animals but saintly people as well.  However, when he came upon the great <em>mah&#257;tm&#257;</em>, Vi&#347;v&#257;mitra &#7770;&#7779;i and his disciples, he suddenly developed some intelligence.  He offered his obeisances to Vi&#347;v&#257;mitra &#7770;&#7779;i and asked, &#34;What are you all doing here?&#34;  Vi&#347;v&#257;mitra replied, &#34;This K&#257;rttika month is the best among all months.  Any work done in this month grows like a huge banyan tree.  If someone performs pious activities by taking an early morning bath, giving charity, worshipping and feeding <em>br&#257;hma&#7751;as</em> in this month he achieves <em>ak&#7779;aya</em> or an imperishable result.&#34;
	  </p>
	  <p>
	    When Vi&#347;v&#257;mitra thus described these glories of the month of K&#257;rttika at the request of the hunter, the cursed son of Deva&#347;arm&#257; who was there in the form of a rat also heard this description.  As soon as Vi&#347;v&#257;mitra concluded his speech, the son of the <em>br&#257;hma&#7751;a</em> who was hearing the glories of K&#257;rttika-vrata immediately transformed, taking on a beautiful, celestial form.  He offered his obeisances to Vi&#347;v&#257;mitra &#7770;&#7779;i and explained his story, and then departed for the heavenly planets.
	  </p>
	  <p>
	    After witnessing this extraordinary event, both Vi&#347;v&#247;mitra and the hunter were very surprised.  The hunter then observed K&#257;rttika-vrata and went back to Vaiku&#7751;&#7789;ha-loka.  This narration clearly illustrates the importance of hearing the pastimes of &#346;r&#299; K&#7771;&#7779;&#7751;a while sitting under the shade of an <em>&#257;malak&#299;</em> tree during the month of K&#257;rttika.  By offering lamps to &#346;r&#299; Hari while sitting under the <em>&#257;malak&#299;</em> tree one will accumulate unlimited <em>pu&#7751;ya</em> or pious results.
	  </p>
	  <hr />
	</div>
	<footer>
	  <p align='right'>
	    <em>Taken from Bhakti Purusottama Swami's book, Damodara Karttika Vrata</em>
	  </p>
	</footer>
  </body>
</html>
