<!DOCTYPE html>
<html>
  <head>
    <title>Sri Damodarastakam</title>
	<link rel="stylesheet" href="styles_damodar.css" />
  </head>
  <body>
    <header>
	  <h1>The Glorious Pastime of Observing the K&#257;rttika Vrata</h1>
	</header>
	<div id="story">
	  <p>
	    There is an ancient story of a very learned <em>br&#257;ma&#7751;a</em> who resided on top of the Saha mountain in the city of K&#257;ver&#299;puram.  His name was Dharmadatta.  Once, during the month of K&#257;rttika, he was on his way to a Vi&#7779;&#7751;u temple to observe his <em>vrata</em> by remaining awake for the entire night.  While he was walking to the temple, holding all the <em>p&#363;j&#257;</em> paraphernalia in his hand, Dharmadatta saw that a dreadful witch was coming towards him.  Upon seeing the witch, Dharmadatta began trembling out of fear.  Gathering some courage he threw the plate, holding all the <em>p&#363;j&#257;</em> paraphernalia, at the witch.  As he threw it, he was remembering Lord Hari.  Amongst the paraphernalia, there happened to be some water with <em>tulas&#299;</em> leaves and as soon as that water touched the witch she was immediately freed from all her sins.  She was suddenly able to remember all her previous life's <em>karma</em> for which she had received the body of a witch.  She offered obeisances to the <em>br&#257;hma&#7751;a</em> and said, &#34;O, <em>br&#257;ma&#7751;a</em>&#33; I have achieved tis condition due to the result of my previous <em>karma</em>.  Please tell me how I can achieve a better destination.&#34;
	  </p>
	  <p>
	    Dharmadatta asked, &#34;From what kind of <em>karma</em> have you attained this condition?  Where are you from?  What is your name?  Tell me everything in detail.&#34;
	  </p>
	  <p>
	    The witch replied, &#34;In my previous life I was the wife of a <em>br&#257;hma&#7751;a</em> who was living in the city of Saur&#257;&#7779;&#7789;ra.  My name was Kalah&#257;.  I was a very cruel-natured woman, never treating my husband well.  What to speak of treating my husband well, I did not even speak a kind word to him.  I never fed him good food, I was always deceptive and very fond of quarrelling.  For this reason my husband was always in anxiety due to my actions.  Finally, he decided to marry a second wife and I committed suicide by drinking poison.  The Yamad&#363;tas then came and bound me, biting me as they dragged me to Yamaloka.  There Yamar&#257;ja asked Citragupta, &#34;Please check what kind of <em>karma</em> this person has performed and award her accordingly.&#34;  Citragupta said, &#34;This person has not performed any good <em>karma</em>.  She would eat all the nicest foods alone, without sharing them with her husband.  She was always adverse to her husband.  For this reason she will take birth as a vampire bird.  She was always fond of quarrelling, for this reason she will take birth as a stool-eating pig.  She used to eat alone from the same pot which she used for cooking, for this reason she will take birth as a cat who eats her own baby.  She has committed suicide, accusing her husband, for this reason she will remain for some time alone in the form of a witch.  She should be sent by the Yamad&#363;tas to a place where there is no water, and she should remain there for a lengthy period in this form of a witch, and following this she will suffer in three different lives.&#34;
	  </p>
	  <p>
	    The witch said, &#34;Oh, Vipravara&#33; I am that most sinful Kalah&#257; who is standing her in front of you in this form of a witch.  I have already spent five hundred years in this body.  I came up here to the confluence of the K&#7771;&#7779;&#7751;&#257; and Ve&#7751;&#299; rivers by possessing the body of a businessman.  As soon as I reached the confluence, the associates of Lord &#346;iva and Lord Vi&#7779;&#7751;u forcibly removed me from the body of this businessman.  Since then I have been wandering hither and thither, suffering from great hunger and thirst.  Now, upon seeing me, you threw your <em>p&#363;j&#257;</em> plate at me, and the water and <em>tulas&#299;</em> touched me, freeing me from all my sins.  O great <em>br&#257;hma&#7751;a</em>, please advise me, how can I become free from this degraded form of a witch and how can I avert the suffering due to me in my next three births?&#34;
	  </p>
	  <p>
	    After hearing this description of Kalah&#257;'s past life, Dharmad&#257;tta thought for some time and then said, &#34;By performing <em>sat-karma</em> like charity, <em>vratas</em> and so on in the holy <em>dh&#257;ma</em>, people are freed from their sins.  But you are in this <em>pret&#257;</em> (witch) boyd, and therefore you are not qualified to perform these activities.  For this reason I will give you half of the pious credits which I have gathered by performing K&#257;rttika <em>vrata</em> throughout my entire life since childhood.  This will certainly guarantee you a better situation.&#34;  Having spoken these words, Dharmadatta sprinkled water with <em>tulas&#299;</em> leaves upon the witch while chanting the <em>dv&#257;da&#347;&#257;k&#7779;ara-mantra</em> or the twelve-syllable mantra.
	  </p>
	  <p>
	    As soon as that <em>tulas&#299;</em> water touched the witch and she heard the mantra, she was released from that pret&#257; body and appeared in the form of a beautiful <em>dev&#299;</em>.  Her beauty was comparable to the beauty of Lak&#7779;m&#299;-dev&#299;.  She then fell on theground to offer her obeisances and spoke in great ecstasy.  &#34;O, best among the <em>br&#257;hma&#7751;as</em>&#33; By your mercy, today I have been freed from this hellish life.  I was drowning in an ocean of sins.  You came like a boat to deliver me from this ocean of sins.&#34;  As she was addressing the <em>br&#257;hma&#7751;a</em>, she could see an effulgent chariot descending from the sky, carrying two Vi&#7779;&#7751;ud&#363;tas, named Pu&#7751;ya&#347;&#299;la and Su&#347;&#299;la.  They were standing at the door of the chariot and carefully picked up the beautiful <em>dev&#299;</em>, placing her on the chariot with them.  Dharmadatta was greatly surprised to see the chariot and he immediately offered prostated obeisances to the messengers of Lord Vi&#7779;&#7751;u.  Pu&#7751;ya&#347;&#299;la and su&#347;&#299;la picked Dharmadatta up from the ground and said, &#34;Oh, best among the <em>br&#257;hma&#7751;as</em>&#33;
	  </p>
	  <p>
	    Thank you so much, because you are always engaged in <em>hari-bhajana</em> and merciful upon fallen and unfortunate souls.  You observe all <em>vi&#7779;&#7751;u-vratas</em>, and by giving half of the result of the K&#257;rttika-vrata whch you have performed since your childhood, you have freed this person from all sins and at the same time the result of your K&#257;rttika-vrata has doubled.  Now I am taking her to Vaiku&#7751;&#7789;ha-dh&#257;ma.  At the end of your life you will also go to Vaiku&#7751;&#7789;ha-dh&#257;ma along with your two wives.  Dharmadatta&#33;
	  </p>
	  <p>
	    Whoever performs worship of Lord Vi&#7779;&#7751;u with devotion, like you, is blessed and his life is successful.  If someone worships Lord Vi&#7779;&#7751;u nicely there is nothing that the Lord will not give him.  He  gave Dhruvaloka to Dhruva Mah&#257;r&#257;ja, the son of Utt&#257;nap&#257;da.  All living entities are delivered just by remembering His holy name.  Previously the king of the elephants was delivered by the Lord just by remembering His name when he was attached by a crocodile.  The K&#257;rttika-vrata which you have observed since your birth, for the pleasure of Lord Vi&#7779;&#7751;u, is the greatest sacrifice.  No <em>yaj&ntilde;a</em>, no charity or <em>t&#299;rtha</em> is equal to this K&#257;rttika-vrata.  You are truly blessed.  Because you have observed K&#257;rttika-vrata which is very dear to Lord Vi&#7779;&#7751;u, and given half the result of this K&#257;rttika-vrata to this lady, she is now going with use to the abode of the Lord, Vaiku&#7751;&#7789;ha-loka.
	  </p>
	  <hr />
	</div>
	<footer>
	  <p align='right'>
	    <em>Taken from Bhakti Purusottama Swami's book, Damodara Karttika Vrata</em>
	  </p>
	</footer>
  </body>
</html>
