<!DOCTYPE html>
<html>
  <head>
    <title>Sri Damodarastakam</title>
	<link rel="stylesheet" href="styles_damodar.css" />
  </head>
  <body>
    <header>
	  <h1>Gu&#7751;avat&#299; Appeared as Satyabh&#257;m&#257; by Performing the D&#257;modara-vrata</h1>
	</header>
	<div id="story">
	  <p>
	    This pastime took place during the end of Satya-yuga.  There was a <em>br&#257;hma&#7751;a</em> living in Haridv&#257;ra, named Deva&#347;arm&#257;.  He appeared in the dynasty of Atri and was very expert int he knowledge of the <em>Vedas</em>.  He was very nicely situated but he had no son.  He had only one daughter whose name was Gu&#7751;avat&#299;.  Deva&#347;arm&#257; arranged for Gu&#7751;avat&#299; to marry one of his disciples named Candra.  Candra was very obedient and had full control of his senses.  He was respectful and served Deva&#347;arm&#257; like his father.
	  </p>
	  <p>
	    One day both Deva&#347;arm&#257; and Candra went to the forest to collect auspicious ingredients like <em>ku&#347;a</em> grass, for a <em>yaj&ntilde;a</em>.  While in the forest, they came across a fearsome demon who killed both of them.  Due to their pious credits in devotional service, both went back to Vaiku&#7751;&#7789;ha.  When Gu&#7751;avat&#299; heard about the death of her father and husband she began to cry pitifully in separation from them.  She sold various items from her house and performed a <em>&#347;r&#257;ddha</em> ceremony according to her capacity.  She then continued to live in that city, although socially she was dead.  She observed two <em>vratas</em> throughout her life, Ek&#257;da&#347;&#299;-vrata and K&#257;rttika-vrata.
	  </p>
	  <p>
	    Every year without fail she observed K&#257;rttika-vrata.  One year she was extremely sick and due to her illness she became very weak.  She was also suffering from fever.  Somehow, due to her determination, she still managed to reach the Ga&#7749;g&#257; to take bath.  As soon as she entered the water, her body went into shock from the cold and she fell to the ground trembling.  In that helpless condition she suddenly saw a chariot descending from the sky.  She then left her material body, boarded the chariot in her spritual body and went to Vaiku&#7751;&#7789;ha-loka, where she stayed near Lord Vi&#7779;&#7751;u due to the pious results of her performing K&#257;rttika-vrata.
	  </p>
	  <p>
	    By the prayer of the demigods, including Brahm&#257; the Lord later appeared on the earth planet in His form of &#346;r&#299; K&#7771;&#7779;&#7751;a.  When the Lord comes to perform His pastimes, all His associates also come with Him.  All the members of the Yadu-va&#7745;&#347;a were associates of the Lord.  Gu&#7751;avat&#299; appeared as Satyabh&#257;m&#257;.  Her father in her previous life, Dev&#347;arm&#257;, appeared as Satr&#257;jit, the father of Satyabh&#257;m&#257;, and her husband in her previous life, Candra, appeared as Akr&#363;ra.  Due to the result of her performance of K&#257;rttika-vrata, Gu&#7751;avat&#299; became very dear to the Lord and appeared as Satyabh&#257;m&#257; to give pleasure to the Lord.  In her previous life she had planted a <em>tulas&#299;</em> garden in front of her house.  As a result of that, she now had a <em>kalpa-v&#7771;k&#7779;a</em> tree in front of her house.
	  </p>
	  <p>
	    Once Satyabh&#257;m&#257; said, &#33;My Lord, I am blessed.  My life is successful by attaining You as my husband.  My Lord, please tell me, in my previous life what kind of pious activities did I perform that I could be so fortune to become Your wife on this earth planet?  Please tell me who I was in my previous life and what I was like.&#34;
	  </p>
	  <p>
	    In reply to this enquiry of Satyabh&#257;m&#257;, &#346;r&#299;K&#7771;&#7779;&#7751;a described the events of her previous life.  The Lord said, &#34;Just by performing K&#257;rttika-vrata, you have attained Me as your husband.&#34;
	  </p>
	  <hr />
	</div>
	<footer>
	  <p align='right'>
	    <em>Taken from Bhakti Purusottama Swami's book, Damodara Karttika Vrata</em>
	  </p>
	</footer>
  </body>
</html>
