<!DOCTYPE html>
<html>
  <head>
    <title>Sri Damodarastakam</title>
	<link rel="stylesheet" href="styles_damodar.css" />
  </head>
  <body>
    <header>
	  <h1>
	    The Glories of Offering an Tulas&#299;-p&#363;j&#257; in the Month of K&#257;rttika
	  </h1>
	</header>
	<div id="story">
	  <p>
	    This is an ancient incident, involving two <em>br&#257;hma&#326;as</em> from the state of K&#257;&#347;m&#299;ra, Sumedha and Harimedha.  They were both great Vi&#7779;&#7751;u-bhaktas and always engaged in devotional service to Lord Vi&#7779;&#7751;u.  They were also very merciful towards all living entities and understood all truths properly.  At one time, these two <em>br&#257;hma&#7751;as</em> started their journey of pilgrimage, and eventually came across a garden of <em>tulas&#299;</em> plants.  At this point they were exhausted from the day's walking, but immediately upon seeing <em>tulas&#299;</em>, Sumedha circumambulated the garden and offered his obeisances very respectfully.  Seeing this, Harimedha asked Sumedha about the glories of <em>tulas&#299;</em> and what the result of offering <em>pra&#7751;&#257;ma</em> to <em>tulas&#299;</em> was.  Sumedha said, &#34;It is too hot here due to the direct sunshine, let us go take shelter of that banyan tree.  There, in the shade of the banyan tree, I will tell you everything.&#34;
	  </p>
	  <p>
	    Sumedha then began, &#34;Long, long ago, Indra, the king of heaven, had lost his position due to the curse of Durv&#257;s&#257; Muni.  At that time Brahm&#257; and all the demigods, as well as all the demons, were engaged in churning the milk ocean.  From that churning of the milk ocean, many wonderful beings and items emerged, such as the elephant Air&#257;vata, the Kalpa-v&#7771;k&#7779;a tree, Candram&#257; or the moon, Lak&#7779;m&#299;, the horse Uccai&#7717;&#347;rav&#257; and the Kaustugha gem.  Lord Hari in the form of Dhanvantari also appeared, along with all celestial medicines and <em>am&#7771;ta</em> to nectar.  As Lord Vi&#7779;&#7751;u was holding that pot of nectar, which has the power to make one immortal, He felt great happiness.  Due to feeling such pleasure, tears began to fall from His eyes and some tears fell into the pot of nectar.
	  </p>
	  <p>
	    The very moment this happened, <em>tulas&#299;</em> appeared from the pot.  All the demigods along with Brahm&#257; offered <em>tulas&#299;</em> and Lak&#7779;m&#299; to Lord &#346;r&#299; Hari, which He accepted with great pleasure.  Since then <em>tulas&#299;</em> has been very dear to Lord Vi&#7779;&#7751;u, who is the protector of the entire universe.  <em>tulas&#299;</em> is His dearmost, therefore I offered her my obeisances.&#34;  As Sumedha was giving the explanation they saw an effulgent chariot racing across the sky towards them.
	  </p>
	  <p>
	    Just then the banyan tree under which they were sitting was uprooted and two celestial beings appeared from within it.  They shone as bright as the sun and lit all the directions.  They offered their obeisances to Sumedha and Harimedha, who were surprised and quite overwhelmed.  They asked, &#34;Who are you both?  Your bodies appear very auspicious, like the <em>devat&#257;s</em>.&#34;  Hearing this, the two effulgent personalities spoke, &#34;Oh, great <em>br&#257;hma&#7751;as!</em>  You are our father, mother, guru, friend and everything to us.&#34;  One of them said, &#34;My name is Astika, I am a resident of Devaloka.  One day I went to Nandana-k&#257;nana to play, where I engaged in pleasurable activities with many celestial ladies for as long as they desired.  At that time the necklace of pearls and <em>bel&#299;</em> flowers from one of the ladies, fell on Loma&#347;a &#7770;&#7779;i who was engaged in <em>tapasya</em> at that place.  Upon seeing this, Loma&#347;a Muni became very angry and he wanted to curse her.  But after consideration he thought, &#34;Ladies have no independence, they always depend on others, therefore this wicked Astika should be punished.&#34;  He then cursed me, saying, &#34;You shall become a <em>brahma- r&#257;k&#7779;asa</em> and reside in a banyan tree.&#34;  After hearing this curse placed upon me, I approached the <em>muni</em> very humbly and asked him, &#34;O, great sage! Please tell me how long I will remain as a <em>brahma-r&#257;k&#7779;asa</em> and how can I be delivered from this curse?&#34;  Being pleased with my humility, the <em>muni</em> said, &#34;When you hear the holy name of Lord Vi&#7779;&#7751;u and the glories of <em>tulas&#299;</em> from the mouth of a <em>br&#257;hma&#7751;a</em> then you will immediately be released from this curse and be liberated.&#34;  Since then I havebeen residing in this banyan tree as a <em>brahma-r&#257;k&#7779;asa</em> in a miserable condition.  Today, having had <em>dar&#347;ana</em> of both of you, I have been delivered from the curse of Loma&#347;a Muni.
	  </p>
	  <p>
	    &#34;Now please hear about my friend.  He was a great <em>muni</em> and always engaged in the service of his guru.  Once he disobeyed the order of his most respectable guru and thus became a <em>brahma-r&#257;k&#7779;asa</em>.  Today by your mercy he has also been delivered.&#34;
	  </p>
	  <p>
	    Having told their stories, both of them offered obeisances to the two <em>br&#257;hma&#7751;as</em>, circumambulated them and then left fro the <em>divya-dh&#257;ma</em>.  The two great <em>br&#257;hma&#7751;as</em>, reciting the glories of <em>tulas&#299;</em>, then left that place and proceeded on their <em>t&#299;rtha-y&#257;tr&#257;</em>.  This illustrates the importance of worshipping <em>tulas&#299;</em> in the month of K&#257;rttika, which gives immense pleasure to Lord Vi&#7779;&#7751;u.
	  </p>
	  <hr />
	</div>
	<footer>
	  <p align='right'>
	    <em>Taken from Bhakti Purusottama Swami's book, Damodara Karttika Vrata</em>
	  </p>
	</footer>
  </body>
</html>
