<!DOCTYPE html>
<html>
  <head>
    <title>Sri Damodarastakam</title>
    <link rel="stylesheet" href="styles_damodar.css" />
  </head>
  <body>  
	<header>
	  <h1>Utthana&#257;na Ek&#257;da&#347;&#299; in the Month of K&#257;rttika</h1>
	</header>
	<div id="story">
	  <p>
	    In ancient times there was a demon named &#346;a&#7749;ka who was the son of S&#257;gara or the ocean.  He forcefully took control of all the planets, including Indraloka.  All the demigods had fled their planets and were hiding in a cave due to fear of this demon.  The demon &#346;a&#7749;kha thought, &#34;Even though I have conquered all demigods, they still appear very powerful.&#34; He realised that the demigods derived their power from Vedic mantras, and thought, &#34;I will plunder the <em>Vedas</em> so that all these demigods will become weak.&#34;  With this consciousness, the demon &#346;a&#7749;kha plundered all the <em>Vedas</em> from Satyaloka, the planet of Brahm&#257;.  While being taken by this demon, the personified <em>Vedas</em>, being afraid, ran away, escaping his control, and merged into the water along with <em>yaj&ntilde;a</em>, mantra and all its seeds.  The demon &#346;a&#7749;kha entered into the ocean in search of the <em>Vedas</em>, but could not find them anywhere.
	  </p>
	  <p>
	    During this time the Lord, who was sleeping, was approached by the demigods offering Him prayers.  Upon hearing their prayers, the Lord awoke and said, &#34;O, demigods! I, being pleased by your prayers, want to give you a boon.  You have woken Me on the Ek&#257;da&#347;&#299; <em>tithi</em> of <em>&#347;ukla-pak&#7779;a</em> (waxing moon) in the month of K&#257;rttika.  For this reason this <em>tittha</em> is very pleasant and respected by Me.  The <em>Vedas</em> which were stolen by the demon &#346;a&#7749;kha have been merged into the ocean.  I will kill this demon &#346;a&#7749;kha and bring you the <em>Vedas</em>.  During this month of K&#257;rttika, anyone who takes an early morning bath should be considered as having taken bath in <em>avabh&#7771;tha</em> (the sanctified water) of the <em>yaj&ntilde;a</em>.  From today, I will reside in the water during the month of K&#257;rttika.  All you demigods along with the <em>munis</em>, please come with me into the water.&#34;  Having said this, the Lord accepted the form of a fish and entered into the water from the sky.  After killing the demon, &#346;a&#7749;kha, the Lord came to the forest of Badar&#299; or Badarik&#257;&#347;rama in the Him&#257;layas.  There He ordered all the <em>&#7771;&#7779;is</em>, &#34;Mun&#299;&#347;varas!  All of you should immediately enter into the ocean and collect all the vedic mantras from the water.  In the mean time I, along with all the demigods, will stay in Pray&#257;ga.&#34;
	  </p>
	  <p>
	    After receiving this order from the Lord all the <em>mah&#257;r&#7779;&#7779;is</em>, by dint of their austerity, rescued the Vedic mantras along with all <em>yaj&ntilde;as</em> and other mantras.  From that day, the <em>&#7771;&#7779;is</em> became connected to the particular mantras that they rescued and each became known as the <em>&#7771;&#7779;i</em> of that mantra.
	  </p>
	  <p>
	    Then all the <em>&#7771;&#7779;is</em> went together to Pray&#257;ga to meet the Lord.  There they offered all the Vedic mantras to Lord Vi&#7779;&#7771;u and Lord Brahm&#257;.  Brahm&#257; was very happy to retrieve all the <em>Vedas</em> and he, along with all the <em>devas</em> and <em>&#7771;&#7779;is</em>, performed an <em>a&#347;vamedha-yaj&ntilde;a</em> at Pray&#257;ga.
	  </p>
	</div>
	<hr />
	<footer>
	  <p align='right'><em>Taken from Bhakti Purusottama Swami's book, Damodara Karttika Vrata</em></p>
	</footer>
  </body>
</html>
